# PointCloudColorSettings Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointCloudColorSettings Members
PointCloudColorSettings Class Constructors Methods Properties See Also
---
The PointCloudColorSettings type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PointCloudColorSettings()()()() | Constructs color settings object with default colors. |
| PointCloudColorSettings(PointCloudColorMode) | Constructs color settings object with default color for given color mode. |
| PointCloudColorSettings(PointCloudColorSettings) | Constructs a copy of source object. |
| PointCloudColorSettings(Color, Color) | Constructs color settings object from given colors. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Assign | Assigns values of the source settings to this object. |
| Dispose | Releases all resources used by the PointCloudColorSettings |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsEqual | Check if the contents of two settings are equal. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Color1 | Color 1 |
| Color2 | Color 2 |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
PointCloudColorSettings Class
Autodesk.Revit.DB.PointClouds Namespace